//import * as crypto from "crypto";

/** ひらがな表 */
const kana = [
  ...["あ", "い", "う", "え", "お"],
  ...["か", "き", "く", "け", "こ"],
  ...["さ", "し", "す", "せ", "そ"],
  ...["た", "ち", "つ", "て", "と"],
  ...["な", "に", "ぬ", "ね", "の"],
  ...["は", "ひ", "ふ", "へ", "ほ"],
  ...["ま", "み", "む", "め", "も"],
  ...["や", "ゆ", "よ"],
  ...["ら", "り", "る", "れ", "ろ"],
  ...["わ", "を", "ん"],
];

/** パスワードの文字数 */
const PASSWORD_LENGTH = 5;

/**
 * ランダムなルームIDを生成する
 * @return 生成されたルームID
 */
export function createRoomId(): string {
  //crypto.randomInt(0, 45);
  return "";
}
